In [2]:
import pandas as pd

In [ ]:
##create Dataframe
pd.DataFrame()

In [4]:
data1= {"name": ['navneet','sharma','dushyat','ritik'],
        "age" : [18,19,20,17],
        "Gender" : ['male','male','male','male']
       }
data1
type(data1)

dict

In [7]:
df = pd.DataFrame(data =data1)
df
type(df)

pandas.core.frame.DataFrame

In [13]:
test_series=df["name"]
test_series

0    navneet
1     sharma
2    dushyat
3      ritik
Name: name, dtype: object

In [14]:
a=df['age']
a

0    18
1    19
2    20
3    17
Name: age, dtype: int64

In [17]:
type(a)
type(test_series)

pandas.core.series.Series

In [68]:
ages = pd.Series([22,23,34],name ='age')
ages

0    22
1    23
2    34
Name: age, dtype: int64

In [49]:
import pandas as pd

# Creating three example Series
series1 = pd.Series([1, 2, 3], index=['A', 'B', 'C'], name='Series1')
series2 = pd.Series([4, 5, 6], index=['A', 'B', 'C'], name='Series2')
series3 = pd.Series([7, 8, 9], index=['A', 'B', 'C'], name='Series3')

# Combining the three Series into a DataFrame
DF = pd.DataFrame({'Series1': series1, 'Series2': series2, 'Series3': series3})

print(DF)

   Series1  Series2  Series3
A        1        4        7
B        2        5        8
C        3        6        9

In [69]:
s1 = pd.Series([1,2,3],index =['a','b','c'],name = 'Series1')
s2 = pd.Series([13,12,53],index =['a','b','c'],name = 'Series2')
s3 = pd.Series([16,20,39],index =['a','b','c'],name = 'Series3')
Df = pd.DataFrame({'Series1': s1, 'Series2': s2, 'Series3': s3})
Df

   Series1  Series2  Series3
a        1       13       16
b        2       12       20
c        3       53       39

In [71]:
data1= {"name": ['navneet','sharma','dushyat','ritik'],
        "age" : [18,19,20,17],
        "Gender" : ['male','male','male','male']
       }
df = pd.DataFrame(data =data1)
df

      name  age Gender
0  navneet   18   male
1   sharma   19   male
2  dushyat   20   male
3    ritik   17   male

In [72]:
df['age']

0    18
1    19
2    20
3    17
Name: age, dtype: int64

In [73]:
df['age'].max()

20

In [74]:
ages.max()

34

In [76]:
df.describe()

             age
count   4.000000
mean   18.500000
std     1.290994
min    17.000000
25%    17.750000
50%    18.500000
75%    19.250000
max    20.000000

In [ ]:
#creating datafrme

In [77]:
country = ['india','pakistan','china', 'nepal']
capital = ['delhi','islamabad','bijing','xyz']
area = [8.516, 17.10, 3.286, 9.67]
population = [200.4, 143.5, 1252, 133]

brics =pd.DataFrame({'countey':country,'captial':capital,'area' : area,'population ': population})
brics

    countey    captial    area  population
0     india      delhi   8.516        200.4
1  pakistan  islamabad  17.100        143.5
2     china     bijing   3.286       1252.0
3     nepal        xyz   9.670        133.0

In [78]:
type(brics)

pandas.core.frame.DataFrame

In [81]:
brics.shape

(4, 4)

In [84]:
num_rows, num_columns = brics.shape

print("Number of Rows:", num_rows)
print("Number of Columns:", num_columns)

Number of Rows: 4
Number of Columns: 4

In [83]:
import pandas as pd

# Example DataFrame
data = {
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9]
}
df = pd.DataFrame(data)

# Retrieving the shape
num_rows, num_columns = df.shape

print("Number of Rows:", num_rows)
print("Number of Columns:", num_columns)

Number of Rows: 3
Number of Columns: 3

In [85]:
brics.columns

Index(['countey', 'captial', 'area', 'population '], dtype='object')

In [86]:
brics.index

RangeIndex(start=0, stop=4, step=1)

In [87]:
brics.index

RangeIndex(start=0, stop=4, step=1)

In [89]:
brics.index = ['A','b','c','d']
brics

    countey    captial    area  population
A     india      delhi   8.516        200.4
b  pakistan  islamabad  17.100        143.5
c     china     bijing   3.286       1252.0
d     nepal        xyz   9.670        133.0

In [107]:
brics.index = range(1,9,2)
brics

    countey    captial    area  population
1     india      delhi   8.516        200.4
3  pakistan  islamabad  17.100        143.5
5     china     bijing   3.286       1252.0
7     nepal        xyz   9.670        133.0

In [108]:
brics.columns

Index(['countey', 'captial', 'area', 'population '], dtype='object')

In [110]:
brics.countey

1       india
3    pakistan
5       china
7       nepal
Name: countey, dtype: object

In [113]:
brics['countey']

1       india
3    pakistan
5       china
7       nepal
Name: countey, dtype: object

In [115]:
brics[['countey']]

    countey
1     india
3  pakistan
5     china
7     nepal

In [130]:
area_datatype = brics.area
area_datatype.dtype

dtype('float64')

In [132]:
b=brics.countey
b.dtype

dtype('O')

In [137]:
brics.set_index('countey')

            captial    area  population
countey
india         delhi   8.516        200.4
pakistan  islamabad  17.100        143.5
china        bijing   3.286       1252.0
nepal           xyz   9.670        133.0

In [138]:
brics

    countey    captial    area  population
1     india      delhi   8.516        200.4
3  pakistan  islamabad  17.100        143.5
5     china     bijing   3.286       1252.0
7     nepal        xyz   9.670        133.0

In [155]:
brics.reset_index()

     area    captial  population
0   8.516      delhi        200.4
1  17.100  islamabad        143.5
2   3.286     bijing       1252.0
3   9.670        xyz        133.0

In [167]:
a = {'pw': ['navneet','dushyant','ritik','raghav'] ,'students':[134,67,70,80],'age':[11,12,24,14]}
df =pd.DataFrame(data =a)
df

         pw  students  age
0   navneet       134   11
1  dushyant        67   12
2     ritik        70   24
3    raghav        80   14

In [170]:
df = df.set_index('pw')
df

          students
pw
navneet        134
dushyant        67
ritik           70
raghav          80

In [171]:
df.reset_index()

         pw  students
0   navneet       134
1  dushyant        67
2     ritik        70
3    raghav        80

In [174]:
df.reset_index(inplace = True)
df

   level_0  index        pw  students
0        0      0   navneet       134
1        1      1  dushyant        67
2        2      2     ritik        70
3        3      3    raghav        80

In [180]:
country = ["Brazil", "Russia", "India", "China", "South Africa"]
capital = ["Brasilia", "Moscow", "New Delhi", "Beijing", "Pretoria"]
area = [8.516, 17.10, 3.286, 9.67, 2.98]
population = [200.4, 143.5, 1252, 133, 4.3]

In [181]:
bric = pd.DataFrame({'country':country,'capital':capital,'area':area,'population':population})
bric

        country    capital    area  population
0        Brazil   Brasilia   8.516       200.4
1        Russia     Moscow  17.100       143.5
2         India  New Delhi   3.286      1252.0
3         China    Beijing   9.670       133.0
4  South Africa   Pretoria   2.980         4.3

In [184]:
b=bric.rename(columns={'country':'count','area':'ar'})
b

          count    capital      ar  population
0        Brazil   Brasilia   8.516       200.4
1        Russia     Moscow  17.100       143.5
2         India  New Delhi   3.286      1252.0
3         China    Beijing   9.670       133.0
4  South Africa   Pretoria   2.980         4.3

In [185]:
c=bric.rename(index ={2:'india',4:'sa'})
c

            country    capital    area  population
0            Brazil   Brasilia   8.516       200.4
1            Russia     Moscow  17.100       143.5
india         India  New Delhi   3.286      1252.0
3             China    Beijing   9.670       133.0
sa     South Africa   Pretoria   2.980         4.3

In [189]:
x=bric.rename(index={0:'br',1:'russia'},columns={'capital':'cap','population':'popu'})
x

             country        cap    area    popu
br            Brazil   Brasilia   8.516   200.4
russia        Russia     Moscow  17.100   143.5
2              India  New Delhi   3.286  1252.0
3              China    Beijing   9.670   133.0
4       South Africa   Pretoria   2.980     4.3

In [196]:
x.reset_index(inplace=True)
x

   level_0   index       country        cap    area    popu
0        0      br        Brazil   Brasilia   8.516   200.4
1        1  russia        Russia     Moscow  17.100   143.5
2        2       2         India  New Delhi   3.286  1252.0
3        3       3         China    Beijing   9.670   133.0
4        4       4  South Africa   Pretoria   2.980     4.3

In [199]:
bric = pd.DataFrame({'country':country,'capital':capital,'area':area,'population':population})
bric

        country    capital    area  population
0        Brazil   Brasilia   8.516       200.4
1        Russia     Moscow  17.100       143.5
2         India  New Delhi   3.286      1252.0
3         China    Beijing   9.670       133.0
4  South Africa   Pretoria   2.980         4.3

In [200]:
bric.set_index('country')

                capital    area  population
country
Brazil         Brasilia   8.516       200.4
Russia           Moscow  17.100       143.5
India         New Delhi   3.286      1252.0
China           Beijing   9.670       133.0
South Africa   Pretoria   2.980         4.3

In [201]:
bric.reset_index()

   index       country    capital    area  population
0      0        Brazil   Brasilia   8.516       200.4
1      1        Russia     Moscow  17.100       143.5
2      2         India  New Delhi   3.286      1252.0
3      3         China    Beijing   9.670       133.0
4      4  South Africa   Pretoria   2.980         4.3

In [202]:
bric

        country    capital    area  population
0        Brazil   Brasilia   8.516       200.4
1        Russia     Moscow  17.100       143.5
2         India  New Delhi   3.286      1252.0
3         China    Beijing   9.670       133.0
4  South Africa   Pretoria   2.980         4.3

In [205]:
bric.reset_index(inplace=True)
bric

ValueError: cannot insert level_0, already exists

<bound method DataFrame.reset_index of    level_0  index       country    capital    area  population
0        0      0        Brazil   Brasilia   8.516       200.4
1        1      1        Russia     Moscow  17.100       143.5
2        2      2         India  New Delhi   3.286      1252.0
3        3      3         China    Beijing   9.670       133.0
4        4      4  South Africa   Pretoria   2.980         4.3>

In [210]:
data = pd.DataFrame({'country':country,'capital':capital,'area':area,'population':population})
data

        country    capital    area  population
0        Brazil   Brasilia   8.516       200.4
1        Russia     Moscow  17.100       143.5
2         India  New Delhi   3.286      1252.0
3         China    Beijing   9.670       133.0
4  South Africa   Pretoria   2.980         4.3

In [211]:
data=data.set_index('country')

In [212]:
data

                capital    area  population
country
Brazil         Brasilia   8.516       200.4
Russia           Moscow  17.100       143.5
India         New Delhi   3.286      1252.0
China           Beijing   9.670       133.0
South Africa   Pretoria   2.980         4.3

In [213]:
data.set_index('capital',inplace=True)

In [214]:
data

             area  population
capital
Brasilia    8.516       200.4
Moscow     17.100       143.5
New Delhi   3.286      1252.0
Beijing     9.670       133.0
Pretoria    2.980         4.3

In [216]:
data.reset_index(inplace=True)

In [225]:
result = data.reset_index(inplace=True)

ValueError: cannot insert level_0, already exists

In [219]:
result

In [229]:
country = ["Brazil", "Russia", "India", "China", "South Africa"]
capital = ["Brasilia", "Moscow", "New Delhi", "Beijing", "Pretoria"]
area = [8.516, 17.10, 3.286, 9.67, 2.98]
population = [200.4, 143.5, 1252, 133, 4.3]

In [232]:
m=pd.DataFrame(data={'country': country, 
                  'capital': capital,
                  'area': area,
                  'population': population})

In [233]:
m

        country    capital    area  population
0        Brazil   Brasilia   8.516       200.4
1        Russia     Moscow  17.100       143.5
2         India  New Delhi   3.286      1252.0
3         China    Beijing   9.670       133.0
4  South Africa   Pretoria   2.980         4.3

In [238]:
m.columns[1]

'capital'

In [239]:
m.index

RangeIndex(start=0, stop=5, step=1)

In [260]:
m.columns

Index(['country', 'capital', 'area', 'population'], dtype='object')

In [261]:
m.columns=range(len(m.columns))

In [262]:
m

              0          1       2       3
0        Brazil   Brasilia   8.516   200.4
1        Russia     Moscow  17.100   143.5
2         India  New Delhi   3.286  1252.0
3         China    Beijing   9.670   133.0
4  South Africa   Pretoria   2.980     4.3

In [268]:
brics.columns[0]

'country'

In [264]:
m.index

RangeIndex(start=0, stop=5, step=1)

In [267]:
m.index[3]

3

In [269]:
import pandas as pd

# Creating a sample DataFrame
ba = pd.DataFrame({
    'Country': ['Brazil', 'Russia', 'India', 'China', 'South Africa'],
    'Population': [209288278, 144421022, 1393409038, 1397715000, 57779622],
    'Area': [8515767, 17098242, 3287263, 9596960, 1221037]
})

# Display the original DataFrame
print("Original DataFrame:")
print(ba)

# Rename the 'Population' column to 'Capital'
ba = ba.rename(columns={'Population': 'Capital'})

# Display the DataFrame after renaming the column
print("\nDataFrame after renaming the 'Population' column to 'Capital':")
print(ba)

Original DataFrame:
        Country  Population      Area
0        Brazil   209288278   8515767
1        Russia   144421022  17098242
2         India  1393409038   3287263
3         China  1397715000   9596960
4  South Africa    57779622   1221037

DataFrame after renaming the 'Population' column to 'Capital':
        Country     Capital      Area
0        Brazil   209288278   8515767
1        Russia   144421022  17098242
2         India  1393409038   3287263
3         China  1397715000   9596960
4  South Africa    57779622   1221037

In [270]:
type(m.columns)

pandas.core.indexes.range.RangeIndex

In [271]:
y=list(m.columns)

In [273]:
y[1]

1

In [277]:
m.index = range(1,10,2)
m

              0          1       2       3
1        Brazil   Brasilia   8.516   200.4
3        Russia     Moscow  17.100   143.5
5         India  New Delhi   3.286  1252.0
7         China    Beijing   9.670   133.0
9  South Africa   Pretoria   2.980     4.3

In [304]:
z=m.reset_index()
z

   index             0          1       2       3
0      1        Brazil   Brasilia   8.516   200.4
1      3        Russia     Moscow  17.100   143.5
2      5         India  New Delhi   3.286  1252.0
3      7         China    Beijing   9.670   133.0
4      9  South Africa   Pretoria   2.980     4.3

In [303]:
z.drop(labels ='index',axis =1)

    country    capital    area  population
0     india      delhi   8.516       200.4
1  pakistan  islamabad  17.100       143.5
2     china     bijing   3.286      1252.0
3     nepal        xyz   9.670       133.0

In [175]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   level_0   4 non-null      int64
 1   index     4 non-null      int64
 2   pw        4 non-null      object
 3   students  4 non-null      int64
dtypes: int64(3), object(1)
memory usage: 260.0+ bytes